def main(group: str=""):
    import re
    group = input("Введите номер своей группы: ")

    test = [["Петров П.П. P3130",
            "Анищенко-Кузнецов А.А. P33117",
            "Примеров Е.В. P3110",
            "Иванов И.И. P3130"], 
            ["Васечкин И.С. P3130",
            "Невасечкина Р.Р. P3130",
            "Куллеров С.С. P3135",
            "Пашкин Р.В. P3167"],
            ["Корабелков Т.Р. P3131",
            "Степашкин В.В. P3130",
            "Толечкина А.А. P3137"],
            ["Барашкин И.Л. P3132",
            "Небарашкина К.К. P3130",
            "Курочкин С.С. P3130",
            "Лебедь И.А. P3125"],
            ["Ремнев Э.Х. P3133",
            "Пушкин А.С. P3134",
            "Толик С.C. P3130",
            "Нетолик У.У. P3130"]]


    for i in range(len(test[0])):
        фамилия, инициал1, инициал2, group1,f = re.split(r'(\w+)\s(\w).(\w).\s(.+)', test[0][i])
        if (инициал1 == инициал2) and (group1 == group):
            continue
        print(test[0][i])
        print(f)
main()
